1s/ERP/Conf/Catalogs/Лико_ПравилаПеремещенияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ПравилаПеремещенияТМЦ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПравил</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтратегииПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ДействияПоПравилуПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ПараметрыВыдачиНоменклатурыВПроизводство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтратегииПеремещенияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтратегииПеремещенияТМЦ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФИФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛИФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокировать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ПравилаПеремещенияТМЦ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ВидНоменклатуры) Тогда
		Объект.ВидНоменклатуры=Объект.Родитель.ВидНоменклатуры;
	КонецЕсли;
	ИнициализироватьКомпоновкуДанных(Ложь,Параметры.ЗначениеКопирования);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	Если ТекущийОбъект.СложнаяНастройка Тогда
		ТекущийОбъект.Описание=Строка(ОтборПоусловию.Настройки.Отбор);
		ТекущийОбъект.ОтборНастройки = Новый ХранилищеЗначения(ОтборПоусловию.Настройки, Новый СжатиеДанных(9));
	Иначе
		ТекущийОбъект.ОтборНастройки = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	ВидНоменклатурыПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	Объект.ТекстСообщения = ТекстСообщения();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	Объект.ТекстСообщения = ТекстСообщения();

КонецПроцедуры



&НаКлиенте
Процедура СложнаяНастройкаПриИзменении(Элемент)
	УстановитьВидимость();

КонецПроцедуры





#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ВидНоменклатурыПриИзмененииНаСервере()
Объект.ДополнительныеРеквизиты.Очистить();
Для каждого ДопРеквизит Из Объект.ВидНоменклатуры.НаборСвойств.ДополнительныеРеквизиты Цикл
	
	НовыйРеквизит= Объект.ДополнительныеРеквизиты.Добавить();
	НовыйРеквизит.Свойство=ДопРеквизит.Свойство;
	
КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию,ЗначениеКопирования=Неопределено)
	
	
		СхемаКомпоновкиДанных = Справочники.Лико_ПравилаПеремещенияТМЦ.ПолучитьМакет("ОтборПоУсловию");
		URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборПоусловию.Инициализировать(ИсточникНастроек);
		
	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		ТекНастройки = Параметры.ЗначениеКопирования.ОтборНастройки.Получить();
	Иначе
		ТекНастройки = Объект.Ссылка.ОтборНастройки.Получить();

	КонецЕсли;
	
	
	Если ТекНастройки = Неопределено Тогда
		
		ОтборПоусловию.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Иначе
		ОтборПоусловию.ЗагрузитьНастройки(ТекНастройки);
	КонецЕсли;
	
	ОтборПоусловию.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьВидимость() //+Лико m.shenderov 29.12.2018
	Если Объект.СложнаяНастройка Тогда
		
		Элементы.Простая.Видимость=Ложь;
		Элементы.Сложная.Видимость=Истина;
		
	Иначе
		
		Элементы.Простая.Видимость=Истина;
		Элементы.Сложная.Видимость=Ложь;

	КонецЕсли;
	
	
	Если Объект.Стратегия=ПредопределенноеЗначение("Перечисление.Лико_СтратегииПеремещенияТМЦ.Заблокировать") Тогда 
		
		Элементы.Действие.Видимость = Ложь;
		Объект.Действие = Неопределено;
		
	Иначе
		
		Элементы.Действие.Видимость = Истина;
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 29.12.2018


&НаКлиенте
Функция ТекстСообщения()		
	
	Возврат Объект.Комментарий + " Ответственный:" +Объект.Ответственный+"."

КонецФункции  

&НаКлиенте
Процедура ПравилоПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура СтратегияПриИзменении(Элемент)
	УстановитьВидимость();

КонецПроцедуры

#КонецОбласти
